scc2425-project-71903-71911/src/main/artillery/users/postUser.yml
#Will return 200 if user doesn't exist, if user exists will return 409. Check if user exists in the db

config:
  target:  "http://localhost:8080/tukano/rest"
  phases:
    - name: postUser
      duration: 5
      arrivalRate: 1
  payload:
    path: ./user.csv
    order: sequence
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "id"
      - "pwd"
      - "email"
      - "displayName"

scenarios:
  - name: "register"
    flow:
      - post:
          url: "/users"
          json:
            id: "{{ id }}"
            pwd: "{{ pwd }}"
            email: "{{ email }}"
            displayName: "{{ displayName }}"